## Q1. List any five functions of the pandas library with execution.

1. read_csv() :  read_csv() function helps read a comma-separated values (csv) file into a Pandas DataFrame.

In [3]:
import pandas as pd
df = pd.read_csv("student.csv")

In [2]:
df

    id         name  class  mark  gender
0    1     John Deo   Four    75  female
1    2     Max Ruin  Three    85    male
2    3       Arnold  Three    55    male
3    4   Krish Star   Four    60  female
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female
13  14         Bigy  Seven    88  female
14  15     Tade Row   Four    88    male
15  16        Gimmy   Four    88    male
16  17        Tumyu    Six    54    male
17  18        Honny   Five    75    male
18  19        Tinny   Nine    18    male
19  20       Jackly   Nine    65  female
20  21   Babby John   Four    69  female
21  22       Reggid  Seven    55  female
22  23        Herod  Eight    79    male
23  24    Tiddy Now  Seven    78    male
24  25     Giff Tow  Seven    88    male
25  26       Crelea  Seven    79    male
26  27     Big Nose  Three    81  female
27  28    Rojj Base  Seven    86  female
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

2. head() : head(n) is used to return first n rows of a dataframe.If no n is passed then first 5 rows are returned.

In [3]:
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

3. describe() : describe() is used to generate descriptive statistics of the data in a Pandas DataFrame or Series.

In [4]:
df.describe()

              id       mark
count  35.000000  35.000000
mean   18.000000  74.657143
std    10.246951  16.401117
min     1.000000  18.000000
25%     9.500000  62.500000
50%    18.000000  79.000000
75%    26.500000  88.000000
max    35.000000  96.000000

4. loc[] : loc[:] helps to access a group of rows and columns in a dataset, a slice of the dataset, as per our requirement.

In [7]:
df.loc[4:12]

    id         name  class  mark  gender
4    5    John Mike   Four    60  female
5    6    Alex John   Four    55    male
6    7  My John Rob  Fifth    78    male
7    8       Asruid   Five    85    male
8    9      Tes Qry    Six    78    male
9   10     Big John   Four    55  female
10  11       Ronald    Six    89  female
11  12        Recky    Six    94  female
12  13          Kty  Seven    88  female

5. tail() :  tail(n) is used to return last n rows of a dataframe.If no n is passed then last 5 rows are returned.

In [10]:
df.tail(7)

    id         name  class  mark  gender
28  29  Tess Played  Seven    55    male
29  30    Reppy Red    Six    79  female
30  31  Marry Toeey   Four    88    male
31  32    Binn Rott  Seven    90  female
32  33    Kenn Rein    Six    96  female
33  34     Gain Toe  Seven    69    male
34  35   Rows Noump    Six    88  female

## Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [23]:
def re_index(df):
     # Create a new index using a range of values starting from 1 and incrementing by 2
    new_index = range(1, 2 * len(df) + 1, 2)

    # Assign the new index to the DataFrame
    df.index = new_index

    return df

In [24]:
df15 = pd.DataFrame({"A":[1,2,3],"B":['a','b','c'],"C":['a',4,6]})

In [25]:
re_index(df15)

   A  B  C
1  1  a  a
3  2  b  4
5  3  c  6

## Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

In [1]:
def iter_df(df):
    print(df["Values"][0:3].sum())

In [2]:
import pandas as pd
d = {"Values":[1,2,3,4,5,6]}
df1 = pd.DataFrame(d)

In [3]:
iter_df(df1)

6

## Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [4]:
def col_Word_Count(df):
    lst = []
    for i in range(len(df['Text'])):
        a = df['Text'][i]
        b = len(a.split(" "))
        lst.append(b)
    df['Word_count'] = lst
    return df

In [5]:
import pandas as pd
data = {'Text':['Happy','Welcome Home','Good Morning to all']}
df5 = pd.DataFrame(data)

In [6]:
col_Word_Count(df5)

                  Text  Word_count
0                Happy           1
1         Welcome Home           2
2  Good Morning to all           4

## Q5. How are DataFrame.size() and DataFrame.shape() different?

DataFrame.size() : Return an int representing the number of elements in this object.Return the number of rows if Series. Otherwise return the number of rows times number of columns if DataFrame.

DataFrame.shape() : Return a tuple representing the dimensionality of the DataFrame.

## Q6. Which function of pandas do we use to read an excel file?

read_excel() function is used to read an excel file.

## Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

In [7]:
def new_col(df):
    lst = []
    for i in range(len(df['Email'])):
        a = df['Email'][i]
        b = a.split('@')
        lst.append(b[0])    
    df['Username'] = lst

In [8]:
import pandas as pd
data = {"Email":["dhruv@gmail.com","rohan@gmail.com","rahul@gmail.com","shubham@yahoo.com"]}
df3 = pd.DataFrame(data)

In [9]:
new_col(df3)

In [10]:
df3

               Email Username
0    dhruv@gmail.com    dhruv
1    rohan@gmail.com    rohan
2    rahul@gmail.com    rahul
3  shubham@yahoo.com  shubham

## Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

In [11]:
def data_frame(df):
    lst=[]
    lst1 = []
    lst2 = []
    for i in range(len(df['A'])):
        if df.loc[i,'A'] > 5 and df.loc[i,'B'] < 10:
            lst.append(df.loc[i,'A'])
            lst1.append(df.loc[i,'B'])
            lst2.append(df.loc[i,'C'])
        else:
            pass
    data  = {'A': lst,'B': lst1,'C':lst2}
    df1 = pd.DataFrame(data)
    return df1

In [12]:
data = {"A":[5,6,3,7,1,8],"B":[1,2,3,14,13,7],"C":[4,2,7,1,8,3]}
df4 = pd.DataFrame(data)

In [13]:
data_frame(df4)

   A  B  C
0  6  2  2
1  8  7  3

## Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.

In [14]:
import pandas as pd

In [15]:
def col_value(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    standard_deviation = df['Values'].std()
    return "The mean is {a} and median is {b} and Standard deviation is {c}".format(a=mean,b=median,c=standard_deviation)

In [16]:
d = pd.DataFrame({"Values":[2,3,4,5,6,12,18]})

In [17]:
col_value(d)

'The mean is 7.142857142857143 and median is 5.0 and Standard deviation is 5.785861256216786'

## Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [18]:
def Moving_Average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7).mean()

In [19]:
date = pd.date_range(start='2022-01-1',end='2022-01-10')
d1 = pd.DataFrame({"Sales":[2300,1355,1276,2800,3500,1200,1400,500,3200,1000],"Date":date})

In [20]:
Moving_Average(d1)

In [21]:
d1

   Sales       Date  MovingAverage
0   2300 2022-01-01            NaN
1   1355 2022-01-02            NaN
2   1276 2022-01-03            NaN
3   2800 2022-01-04            NaN
4   3500 2022-01-05            NaN
5   1200 2022-01-06            NaN
6   1400 2022-01-07    1975.857143
7    500 2022-01-08    1718.714286
8   3200 2022-01-09    1982.285714
9   1000 2022-01-10    1942.857143

## Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

In [22]:
def func_day(df):
    df["Weekday"] = df["Date"].dt.dayofweek
    df['Weekday'] = df['Weekday'].map({
    0: 'Monday',
    1: 'Tuesday',
    2: 'Wednesday',
    3: 'Thursday',
    4: 'Friday',
    5: 'Saturday',
    6: 'Sunday'
})

## Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [34]:
def get_row(df):
    lst = []
    date_range = pd.date_range(start='2023-01-01',end='2023-01-31')
    for i in df['Date']:
        for j in date_range:
            if i == j:
                lst.append(j)
            else:
                pass
    return lst

In [32]:
date1 = pd.date_range(start='2023-01-15',end='2023-02-25')
df5 = pd.DataFrame({"Date":date1})

In [35]:
get_row(df5)

[Timestamp('2023-01-15 00:00:00', freq='D'),
 Timestamp('2023-01-16 00:00:00', freq='D'),
 Timestamp('2023-01-17 00:00:00', freq='D'),
 Timestamp('2023-01-18 00:00:00', freq='D'),
 Timestamp('2023-01-19 00:00:00', freq='D'),
 Timestamp('2023-01-20 00:00:00', freq='D'),
 Timestamp('2023-01-21 00:00:00', freq='D'),
 Timestamp('2023-01-22 00:00:00', freq='D'),
 Timestamp('2023-01-23 00:00:00', freq='D'),
 Timestamp('2023-01-24 00:00:00', freq='D'),
 Timestamp('2023-01-25 00:00:00', freq='D'),
 Timestamp('2023-01-26 00:00:00', freq='D'),
 Timestamp('2023-01-27 00:00:00', freq='D'),
 Timestamp('2023-01-28 00:00:00', freq='D'),
 Timestamp('2023-01-29 00:00:00', freq='D'),
 Timestamp('2023-01-30 00:00:00', freq='D'),
 Timestamp('2023-01-31 00:00:00', freq='D')]

## Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

pandas library need to be imported to use basic functions of pandas